In [5]:
# Import Dependencies and Setup
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sql_password import password

In [6]:
# Create Engine and connect
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/EmployeeSQL')
connection = engine.connect()

In [7]:
# Read table
salaries = pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no salary
0   10001  60117
1   10002  65828
2   10003  40006
3   10004  40054
4   10005  78228

In [8]:
# Check for null values
salaries.isnull().sum()

emp_no    0
salary    0
dtype: int64

In [9]:

# Create histogram of employee salaries
salaries.hist("salary", color = "red")
plt.xlabel('Salary ($)')
plt.ylabel('Number of Employees')
plt.title('Salary Range For Employees')

plt.savefig("images/salary_range_for_all_employees.png")

plt.show()

ValueError: hist method requires numerical or datetime columns, nothing to plot.

In [10]:
# Read titles table
titles = pd.read_sql("SELECT * FROM titles", connection)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [11]:
# Check for null values
titles.isnull().sum()

title_id    0
title       0
dtype: int64

In [12]:
# Read employees table
employees = pd.read_sql("SELECT emp_no, emp_title_id FROM employees", connection)
employees.head()

   emp_no emp_title_id
0  473302        s0001
1  475053        e0002
2   57444        e0002
3  421786        s0001
4  282238        e0003

In [13]:
# Check for null values
employees.isnull().sum()

emp_no          0
emp_title_id    0
dtype: int64

In [14]:
# Combine all three tables
combined_df = pd.merge(employees, titles, how = "inner", left_on = "emp_title_id", right_on = "title_id")
combined_df = pd.merge(combined_df, salaries, how = "inner", on = "emp_no")
combined_df

        emp_no emp_title_id title_id    title salary
0       473302        s0001    s0001    Staff  40000
1       421786        s0001    s0001    Staff  40000
2       273487        s0001    s0001    Staff  56087
3       246449        s0001    s0001    Staff  87084
4        48085        s0001    s0001    Staff  63016
...        ...          ...      ...      ...    ...
300019  111400        m0001    m0001  Manager  72446
300020  111133        m0001    m0001  Manager  71148
300021  110085        m0001    m0001  Manager  60026
300022  110386        m0001    m0001  Manager  40000
300023  111784        m0001    m0001  Manager  40000

[300024 rows x 5 columns]

In [15]:
# Check for null values
combined_df.isnull().sum()

emp_no          0
emp_title_id    0
title_id        0
title           0
salary          0
dtype: int64

In [20]:
# Group tables by Title
group_df = combined_df.groupby("title").mean()
group_df = group_df["salary"].reset_index()
group_df.head()

KeyError: 'salary'

In [19]:
# Create bar chart of average salary by title
x_axis = group_df["title"]
xticks = np.arange(len(x_axis))
y_axis = group_df["salary"]

plt.bar(x_axis, y_axis, align = "center", color = "blue")
plt.xticks(rotation=90)

plt.title("Average Salary per Title")
plt.ylabel('Salary ($)')
plt.xlabel('Title')

plt.savefig("images/average_salary_per_title.png")

plt.show()

KeyError: 'title'